<%--
  Created by IntelliJ IDEA.
  User: Home
  Date: 2024-08-08 (목)
  Time: 오후 6:08
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>read me</title>
</head>
<body>
<h3>
    4월 중순에 학원 수료 후 학원측에서 피드백 받았던 이력서도 같이 올리고 싶었는데 아쉽게도 하나만 올라가네요
    6월말쯤 새로 작성한 이력서입니다. 학원에서 해주는 방식과 요새 트렌드가 약간 다른것 같기도 했고 변화를 좀 주고는 싶은데
    어떻게 해야할지 몰라서 유트브나 취업관련 사이트, 포트폴리오나 자기소개서 등등 찾아보면서 수정했습니다.
    이전에 학원측에서도 계속 수정은 해야한다 얘기는 했는데 구체적인 방향성을 제시해주지 않아서 이게 맞는지도 모르겠습니다

    블로그의 경우 https://callipix.tistory.com/인데 현재 이력서에는 전부 지웠습니다.
    깃/블로그 관련해서는 한가지 말씀드리고 싶은게 처음 목적은 수업내용 그때그때 코드복붙이라도 해놓고
    정규수업 이후 복습하자는 생각으로 당시 코드복붙만 해놨었습니다. 막상 해보니 잘 안하게 되더라구요..
    나중에 정리하려고 보니 안하느니만 못한수준 같고 올리지 않는게 낫겠다 싶을 정도로 엉망이라고 생각해서
    학원측에 얘기했었는데 이부분은 학원에서 뭐라도 없는것보단 낫다고 적으라 해서 억지로 적어놓게 됐어요.
    처음부터 잘 관리를 하거나 했어야 하는데 막막하기도 하고 어렵더라구요. 이부분은 제가 면접관이라면?
    왜 올렸지? 싶은 생각이 강하게 들것 같아서 현재 지원중인 이력서에서는 지웠습니다.

    그리고 미니프로젝트의 경우는 특별한 주제는 아니고 기본적인 crud와 같이 혼자서 간단한 게시판 정도까지 전부 해보자
    하는 생각으로 약 2,3주정도 진행했습니다. aws를 이용해서 서버도 돌려보고 s3로 파일업로드까지 사용해서 해당 게시판 내에
    지금까지 진행했던 내역들이나 프로젝트 정보들을 작성하려고 하고 도메인으로 연결해놓고 이력서에 링크를 걸어놓고
    이번 화요일부터 이력서 지원하기 시작했는데 전부 이력서 확인은 해도 프로젝트 링크에 접속은 전혀 없더라구요.
    미니프로젝트의 경우는 git에 이전보다는 신경을 썼습니다.

    현재 제가 나이도 적지않고 학력이 고졸이라 많은 부분에서 불리하다는걸 잘 알고있습니다. 학원측을 통해 약 10~15곳,
    개인지원으로 20곳 정도 지원을 해보았으나 전부 서류에서 탈락되는지라 어느부분에서 부족한지 정확히 판단을 좀 받아보고 싶습니다.
    학원측에서는 기존에 처음 피드백 해줬던 이력서나 포트폴리오등에선 큰 문제는 없다고 하나 제 생각엔 잘 모르겠습니다.
    새로 작성한 부분도 뭔가 아닌것 같기도 하고.. 전부 문제인것 같은데 어느부분이 문제인지 다소 직설적이더라도 솔직하고 상세한 피드백 부탁드리겠습니다.
</h3>
</body>
</html>
